{
  "backend/main.mo": "Motoko actor defining transaction types (mint, burn, transfer) and exposing query/update methods to fetch recent transactions and ICRC1 transactions with parsed memo details and stub data.",
  "feature_evidence.json": "Empty feature evidence report JSON with no recorded features.",
  "frontend-file-summaries.txt": "JSON document containing one-sentence summaries of all frontend source files, describing each component's purpose and recent changes.",
  "frontend/index.css": "Global Tailwind CSS entry point defining OKLCH-based CSS custom properties for light and dark theme color tokens including background, foreground, chart, and sidebar variables.",
  "frontend/index.html": "Minimal HTML shell with a root div and module script entry point for the BITTY ON ICP INDEX Vite/React application.",
  "frontend/src/App.tsx": "Root React component composing the full page layout with Header, AnimatedCoin hero, SupplyMetrics, NavigationTabs, VideoSection, TransactionList, and Footer.",
  "frontend/src/components/AddressSearch.tsx": "Empty file placeholder for the AddressSearch component.",
  "frontend/src/components/AnimatedCoin.tsx": "Animated coin component that cycles a rolling CSS animation on a circular BITTY coin image every 10 seconds with ambient glow effects.",
  "frontend/src/components/Footer.tsx": "Footer component showing copyright year and the BITTY ledger canister ID in amber monospace text.",
  "frontend/src/components/Header.tsx": "Sticky navigation header with BITTY ON ICP branding/logo on the left and an external link to bittyonicp.com on the right.",
  "frontend/src/components/HolderList.tsx": "Empty file placeholder for the HolderList component.",
  "frontend/src/components/NavigationTabs.tsx": "Renders two full-width amber-styled external link buttons navigating to ICPSwap liquidity positions and the ICPSwap pro trading interface.",
  "frontend/src/components/PriceDisplay.tsx": "Empty file placeholder for the PriceDisplay component.",
  "frontend/src/components/SupplyMetrics.tsx": "Card component displaying hardcoded total and circulating BITTY supply (999,999,999.92M) with amber gradient styling.",
  "frontend/src/components/TokenMetrics.tsx": "Empty file placeholder for the TokenMetrics component.",
  "frontend/src/components/TransactionList.tsx": "React component that displays a paginated table of recent BITTYICP token transactions, with type badges (buy/sell/transfer), formatted addresses, amounts, and timestamps, using React Query for data fetching.",
  "frontend/src/components/VideoSection.tsx": "Simple React component that renders a full-width autoplaying looped muted video section using two .mov source files.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and caches an ICP backend actor (authenticated or anonymous) via React Query, and invalidates dependent queries whenever the actor changes.",
  "frontend/src/hooks/useAddressBalance.ts": "Empty file with no implementation.",
  "frontend/src/hooks/useHolderData.ts": "Empty file with no implementation.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an Internet Identity authentication context and provider using DFINITY's AuthClient, exposing login/logout functions, identity state, and login status to child components.",
  "frontend/src/hooks/usePriceData.ts": "Empty file with no implementation.",
  "frontend/src/hooks/useQueries.ts": "Defines a React Query hook `useGetRecentTransactions` that fetches recent BITTYICP transactions from the backend actor with a 4-minute stale time and 5-minute refetch interval.",
  "frontend/src/hooks/useTransactions.ts": "Empty file with no implementation.",
  "frontend/src/index.css": "Global CSS file defining Tailwind base/components/utilities, a gold-themed OKLCH color palette for light and dark modes, and a coin-rolling keyframe animation.",
  "frontend/src/main.tsx": "React app entry point that wraps the App component with TanStack QueryClientProvider and InternetIdentityProvider before mounting to the DOM.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending the default theme with OKLCH-based gold color tokens, custom border radii, gold glow box shadows, font families, and accordion/shimmer animations.",
  "project_state.json": "Project state metadata describing the BITTY ON ICP Blockchain Explorer, documenting a known Motoko RTS crash ('blob_of_principal: invalid principal') caused by invalid burn/minting account principals in ledger data, with a pending fix request to validate and skip invalid principals."
}