{
  "backend/main.mo": "Main backend actor providing token swap, address validation, holder info retrieval, and live metrics (price, market cap, volume) with hardcoded data and HTTP outcall transformation support.",
  "feature_evidence.json": "Empty feature evidence report with no features documented.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend components, hooks, and configuration files describing the BITTY token explorer UI structure and functionality.",
  "frontend/index.css": "Tailwind CSS configuration with OKLCH color system defining CSS variables for light and dark themes with gold/amber accent colors.",
  "frontend/index.html": "HTML entry point with root div and module script loading for the BITTY ON ICP INDEX application.",
  "frontend/src/App.tsx": "Main application component orchestrating hero section with animated coin, supply metrics, token metrics, navigation tabs, video section, holder list, and indexing status alert.",
  "frontend/src/components/AddressSearch.tsx": "Empty file placeholder for address search component.",
  "frontend/src/components/AnimatedCoin.tsx": "2D coin animation component displaying BITTY coin image with rolling animation cycle (5s roll, 5s pause) and gradient background effects.",
  "frontend/src/components/Footer.tsx": "Footer component displaying copyright, current year, and ledger canister ID with responsive layout.",
  "frontend/src/components/Header.tsx": "Sticky header with BITTY branding, coin icon, and external link to bittyonicp.com with amber gradient styling.",
  "frontend/src/components/HolderList.tsx": "Card component displaying token holders in a sortable table (by balance descending) with address, balance, and supply percentage columns, including loading and error states.",
  "frontend/src/components/NavigationTabs.tsx": "Two full-width navigation buttons linking to ICPSwap liquidity and trading pages with amber gradient styling and hover effects.",
  "frontend/src/components/PriceDisplay.tsx": "Empty file placeholder for price display component.",
  "frontend/src/components/SupplyMetrics.tsx": "Displays BITTY token supply metrics (total and circulating supply) in a card with amber-themed styling and gradient text effects.",
  "frontend/src/components/TokenMetrics.tsx": "Shows live token market data including price, market cap, and 24-hour volume with loading states, error handling, and formatted number displays.",
  "frontend/src/components/TransactionList.tsx": "Empty file with no content.",
  "frontend/src/components/VideoSection.tsx": "Renders an auto-playing looping video section with multiple video source formats for browser compatibility.",
  "frontend/src/hooks/useActor.ts": "Manages ICP actor creation with Internet Identity authentication, automatically invalidating and refetching dependent queries when identity changes.",
  "frontend/src/hooks/useAddressBalance.ts": "Empty file with no content.",
  "frontend/src/hooks/useHolderData.ts": "Wrapper hook that fetches and returns holder data with loading and error states using useGetHolderData query.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context and hooks for login/logout functionality with AuthClient integration and identity management.",
  "frontend/src/hooks/usePriceData.ts": "Empty file with no content.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching holder data (5-minute refetch) and metrics (1-minute refetch) from the backend actor.",
  "frontend/src/hooks/useTransactions.ts": "Empty file with no content.",
  "frontend/src/index.css": "Defines Tailwind CSS configuration with gold-themed color palette for light/dark modes, custom coin rolling animation, and utility classes.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query and Internet Identity providers, then renders the App component.",
  "frontend/tailwind.config.js": "Tailwind configuration with custom gold-themed color system using OKLCH, extended animations (accordion, shimmer), and typography/container plugins.",
  "project_state.json": "Project state file tracking a blockchain explorer for BITTY ON ICP token with features including transaction history, address search, live price data, supply metrics, 2D coin animation, and holder list. Documents known issue with address search not returning balance results and notes that price display functionality was removed to be rebuilt."
}