{
  "backend/main.mo": "Main actor implementing token swap, address validation, and holder information queries with hardcoded transaction data and a single holder principal.",
  "backend/migration.mo": "Migration module providing a run function that accepts an old actor and returns an empty object for state migration.",
  "feature_evidence.json": "Feature evidence report documenting two features: updating frontend to fetch complete holder list from backend and revising the indexing banner message to reflect completed historical backfill.",
  "frontend-file-summaries.txt": "JSON object containing summaries of all frontend source files including components, hooks, and configuration files.",
  "frontend/index.css": "Global CSS with Tailwind directives defining OKLCH-based color variables for light and dark themes with gold/amber accent colors.",
  "frontend/index.html": "HTML entry point with root div and module script loading the React application titled 'BITTY ON ICP INDEX'.",
  "frontend/src/App.tsx": "Main application component rendering header, hero section with animated coin, indexing status alert, supply metrics, holder list, and footer.",
  "frontend/src/components/AddressSearch.tsx": "Empty component file with no implementation.",
  "frontend/src/components/AnimatedCoin.tsx": "Component displaying a circular coin image with CSS animation that rolls and pauses in a 10-second cycle with glimmer effects.",
  "frontend/src/components/Footer.tsx": "Footer component displaying copyright year and BITTY ledger canister ID without external attribution.",
  "frontend/src/components/Header.tsx": "Sticky header with BITTY branding, coin icon, and navigation link to ICPSwap trading page.",
  "frontend/src/components/HolderList.tsx": "Card component displaying token holders in a table sorted by balance descending, showing address, balance, and percentage of supply with loading and empty states.",
  "frontend/src/components/PriceDisplay.tsx": "Empty component file with no implementation.",
  "frontend/src/components/SupplyMetrics.tsx": "Card component displaying total and circulating supply metrics for BITTY tokens (999,999,999.92M) with formatted numbers and 100% circulation indicator.",
  "frontend/src/components/TransactionList.tsx": "Empty component file with no implementation.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and manages an authenticated or anonymous actor for backend canister communication, using Internet Identity for authentication and React Query for caching. Invalidates dependent queries when the actor changes.",
  "frontend/src/hooks/useAddressBalance.ts": "Empty file placeholder for address balance functionality.",
  "frontend/src/hooks/useHolderData.ts": "Custom hook that wraps useGetHolderData to fetch and return holder data with loading and error states.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context and hooks for login/logout functionality using DFINITY's AuthClient. Manages authentication state, identity persistence, and delegation validation.",
  "frontend/src/hooks/usePriceData.ts": "Empty file placeholder for price data functionality.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for data fetching, currently implementing useGetHolderData which fetches unique holder addresses from the backend actor with 4-minute stale time and 5-minute refetch interval.",
  "frontend/src/hooks/useTransactions.ts": "Empty file placeholder for transaction functionality.",
  "frontend/src/index.css": "Tailwind CSS configuration with gold-themed color palette for BITTY token, including light/dark mode variables, custom coin rolling animation keyframes, and utility classes for gradients and animations.",
  "frontend/src/main.tsx": "Application entry point that sets up React root with QueryClientProvider for data fetching and InternetIdentityProvider for authentication, then renders the App component.",
  "frontend/tailwind.config.js": "Tailwind configuration extending default theme with custom colors using OKLCH color space, gold-themed shadows, custom animations (accordion, shimmer), and typography/container query plugins.",
  "project_state.json": "Project state document describing BITTY ON ICP blockchain explorer with features including transaction indexing, holder tracking, address search, supply metrics, and 2D coin animation. Notes known issues with tagline and footer text."
}