{
  "backend/main.mo": "Main backend actor providing token swap, address validation, holder info retrieval, transaction indexing, and live metrics (price, volume, market cap) with hardcoded mock data for BITTY token.",
  "feature_evidence.json": "Feature evidence report documenting four high-confidence features: restoring TransactionList component with pagination, implementing useTransactions hook, adding TransactionList to App.tsx, and debugging HolderList rendering.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend files including components (Header, Footer, AnimatedCoin, metrics displays, lists), hooks (queries, transactions, holders), and styling configurations with gold/amber theme.",
  "frontend/index.css": "Global Tailwind CSS styles with OKLCH-based color system for light and dark modes, featuring gold/amber theme variables and base styling for background, foreground, borders, and UI elements.",
  "frontend/index.html": "HTML entry point with UTF-8 charset, viewport meta tag, title 'BITTY ON ICP INDEX', root div, and module script loading main.tsx.",
  "frontend/src/App.tsx": "Main application component orchestrating layout with Header, Footer, hero section with AnimatedCoin, metrics displays, navigation tabs, VideoSection, HolderList, TransactionList, and indexing status alert.",
  "frontend/src/components/AddressSearch.tsx": "Empty file placeholder for address search component.",
  "frontend/src/components/AnimatedCoin.tsx": "2D animated coin component displaying BITTY coin image with CSS roll animation that cycles every 10 seconds (5s roll + 5s pause) with gradient background and glimmer effects.",
  "frontend/src/components/Footer.tsx": "Footer component displaying copyright year, BITTY ON ICP INDEX branding, and ledger canister ID (qroj6-lyaaa-aaaam-qeqta-cai) with border and backdrop blur styling.",
  "frontend/src/components/Header.tsx": "Sticky header with BITTY ON ICP branding (coin icon and title) on left and BITTYONICP.COM external link with icon on right, featuring amber gradient styling and backdrop blur.",
  "frontend/src/components/HolderList.tsx": "Displays a sortable table of token holders with their addresses, balances, and percentage of total supply, including loading states and error handling.",
  "frontend/src/components/NavigationTabs.tsx": "Renders two external link buttons for Liquidity and Trade on ICPSwap with styled hover effects and external link icons.",
  "frontend/src/components/PriceDisplay.tsx": "Empty component file with no content.",
  "frontend/src/components/SupplyMetrics.tsx": "Displays static total and circulating supply metrics for BITTY tokens (999,999,999.92M) with formatted numbers and visual indicators.",
  "frontend/src/components/TokenMetrics.tsx": "Shows live token market data including price, market cap, and 24-hour volume with loading skeletons and error states.",
  "frontend/src/components/TransactionList.tsx": "Displays paginated transaction history with from/to addresses, amounts, status, and timestamps, including navigation controls and loading states.",
  "frontend/src/components/VideoSection.tsx": "Renders an auto-playing, looping video section with multiple source formats for browser compatibility.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and manages an authenticated or anonymous actor based on Internet Identity, invalidating dependent queries when identity changes.",
  "frontend/src/hooks/useAddressBalance.ts": "Empty hook file with no content.",
  "frontend/src/hooks/useHolderData.ts": "Wrapper hook that fetches holder data using useGetHolderData and returns holders array with loading and error states.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context with login/logout functionality, identity management, and status tracking using AuthClient.",
  "frontend/src/hooks/usePriceData.ts": "Empty hook file with no content.",
  "frontend/src/hooks/useQueries.ts": "Defines three React Query hooks (useGetHolderData, useGetIndexedTransactions, useGetMetrics) that fetch data from the backend actor with automatic refetching intervals (5 minutes for holder/transaction data, 1 minute for metrics).",
  "frontend/src/hooks/useTransactions.ts": "Provides a useTransactions hook that paginates indexed transactions (25 per page) and returns paginated results along with pagination metadata and loading/error states.",
  "frontend/src/index.css": "Defines Tailwind CSS configuration with gold-themed color palette for light/dark modes, custom coin rolling animation keyframes, and utility classes for gradients and animation delays.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query client and wraps the App component with QueryClientProvider and InternetIdentityProvider contexts.",
  "frontend/tailwind.config.js": "Tailwind configuration extending the theme with custom colors using OKLCH color space, border radius variables, gold glow shadows, custom fonts, and animation keyframes for accordion and shimmer effects.",
  "project_state.json": "Project metadata describing BITTY ON ICP INDEX blockchain explorer with transaction indexing, holder tracking, and known issue that TransactionList and HolderList components are not rendering on the page."
}