{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Fix holder data system frontend display",
  "requirements": [
    {
      "id": "REQ-73",
      "summary": "Update frontend HolderList component and useHolderData hook to properly fetch and display the complete holder list from the fixed backend",
      "acceptanceCriteria": [
        "HolderList component displays all 344 holders fetched from backend",
        "Table shows address, balance in BITTYICP, and percentage of total supply for each holder",
        "useHolderData hook successfully queries backend getHolderData method",
        "Loading states display while fetching holder data",
        "Error states are cleared once data loads successfully"
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useHolderData.ts",
          "operation": "modify",
          "description": "Update the useHolderData hook to properly call the backend getUniqueHolderAddresses method which returns the complete holder list. Ensure the hook correctly maps the HolderInfo array response containing principal, balance, and percentage fields. Verify error handling captures any backend query failures and that loading states properly reflect the async query status."
        },
        {
          "path": "frontend/src/components/HolderList.tsx",
          "operation": "modify",
          "description": "Update the HolderList component to display all holder data fields from the useHolderData hook including principal address (formatted for display), balance in BITTYICP tokens (formatted with appropriate decimal places), and percentage of total supply. Ensure the table continues to sort by balance in descending order. Verify loading skeleton states display during initial fetch and that error states are properly cleared when data successfully loads. Update empty state messaging to reflect when zero holders are returned versus when data is loading."
        },
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Update the useGetHolderData query hook to call the correct backend method getUniqueHolderAddresses which returns Array<HolderInfo>. Ensure the query key is correctly configured and that the 5-minute refetch interval continues to work. Verify that the actor dependency is properly tracked so queries refetch when authentication state changes."
        }
      ]
    }
  ]
}